{
  "alignment": {
    "lg": {
      "name": "Lawful Good",
      "details": "A lawful good character acts as a good person is expected or required to act. They combine a commitment to oppose evil with the discipline to fight relentlessly. They tell the truth, keep their word, help those in need, and speak out against injustice. A lawful good character hates to see the guilty go unpunished.  Lawful good is the best alignment you can be because it combines honor and compassion.  However, lawful good can be a dangerous alignment when it restricts freedom and criminalizes self-interest."
    },
    "ng": {
      "name": "Neutral Good",
      "details": "A neutral good character does the best that a good person can do. They are devoted to helping others. They work with kings and magistrates but do not feel beholden to them. Neutral good is the best alignment you can be because it means doing what is good without bias for or against order. However, neutral good can be a dangerous alignment when it advances mediocrity by limiting the actions of the truly capable."
    },
    "cg": {
      "name": "Chaotic Good",
      "details": "A chaotic good character acts as their conscience directs them with little regard for what others expect of them. They make their own way, but they're kind and benevolent. They believe in goodness and right but have little use for laws and regulations. They hate it when people try to intimidate others and tell them what to do. They follow their own moral compass, which, although good, may not agree with that of society. Chaotic good is the best alignment you can be because it combines a good heart with a free spirit. However, chaotic good can be a dangerous alignment when it disrupts the order of society and punishes those who do well for themselves."
    },
    "ln": {
      "name": "Lawful Neutral",
      "details": "A lawful neutral character acts as law, tradition, or a personal code directs them. Order and organization are paramount to them. They may believe in personal order and live by a code or standard, or they may believe in order for all and favor a strong, organized government. Lawful neutral is the best alignment you can be because it means you are reliable and honorable without being a zealot. However, lawful neutral can be a dangerous alignment when it seeks to eliminate all freedom, choice, and diversity in society."
    },
    "nn": {
      "name": "True Neutral",
      "details": "A true neutral character does what seems to be a good idea. They don't feel strongly one way or the other when it comes to good vs. evil or law vs. chaos. Most true neutral characters exhibit a lack of conviction or bias rather than a commitment to neutrality. Such a character thinks of good as better than evil; after all, they would rather have good neighbors and rulers than evil ones. Still, they're not personally committed to upholding good in any abstract or universal way. Some true neutral characters, on the other hand, commit themselves philosophically to neutrality. They see good, evil, law, and chaos as prejudices and dangerous extremes. They advocate the middle way of neutrality as the best, most balanced road in the long run. True neutral is the best alignment you can be because it means you act naturally, without prejudice or compulsion. However, true neutral can be a dangerous alignment when it represents apathy, indifference, and a lack of conviction."
    },
    "cn": {
      "name": "Chaotic Neutral",
      "details": "A chaotic neutral character follows their whims. They are an individualist first and last. They value their own liberty but don't strive to protect others' freedom. They avoid authority, resent restrictions, and challenge traditions. A chaotic neutral character does not intentionally disrupt organizations as part of a campaign of anarchy. To do so, they would have to be motivated either by good (and a desire to liberate others) or evil (and a desire to make those different from themself suffer). A chaotic neutral character may be unpredictable, but their behavior is not totally random. They are not as likely to jump off a bridge as to cross it. Chaotic neutral is the best alignment you can be because it represents true freedom from both   society's restrictions and a do-gooder's zeal. However, chaotic neutral can be a dangerous   alignment when it seeks to eliminate all authority, harmony, and order in society."
    },
    "le": {
      "name": "Lawful Evil",
      "details": "A lawful evil villain methodically takes what they want within the limits of their code of conduct without regard for whom it hurts. They care about tradition, loyalty, and order but not about freedom, dignity, or life. They play by the rules but without mercy or compassion. They are comfortable in a hierarchy and would like to rule, but are willing to serve. They condemn others not according to their actions but according to race, religion, homeland, or social rank. They are loath to break laws or promises.  This reluctance comes partly from their nature and partly because they depend on order to protect themself from those who oppose them on moral grounds. Some lawful evil villains have particular taboos, such as not killing in cold blood (but having underlings do it) or not letting children come to harm (if it can be helped). They imagine that these compunctions put them above unprincipled villains.  Some lawful evil people and creatures commit themselves to evil with a zeal like that of a crusader committed to good. Beyond being willing to hurt others for their own ends, they take pleasure in spreading evil as an end unto itself. They may also see doing evil as part of a duty to an evil deity or master. Lawful evil is sometimes called diabolical, because devils are the epitome of lawful evil. Lawful evil is the best alignment you can be because it combines honor and dedicated self-interest. However, lawful evil can be a dangerous alignment because it represents methodical, intentional, and frequently successful evil."
    },
    "ne": {
      "name": "Neutral Evil",
      "details": "A neutral evil villain does whatever they can get away with. They are out for themself, pure and simple. They shed no tears for those they kill, whether for profit, sport, or convenience. They have no love of order and hold no illusion that following laws, traditions, or codes would make hithemm any better or more noble. On the other hand, they don't have the restless nature or love of conflict that a chaotic evil villain has.  Some neutral evil villains hold up evil as an ideal, committing evil for its own sake. Most often, such villains are devoted to evil deities or secret societies. Neutral evil is the best alignment you can be because you can advance yourself without regard for others. However, neutral evil can be a dangerous alignment because it represents pure evil without honor and without variation."
    },
    "ce": {
      "name": "Chaotic Evil",
      "details": "A chaotic evil character does whatever their greed, hatred, and lust for destruction drive them to do. They are hot-tempered, vicious, arbitrarily violent, and unpredictable. If they are simply out for whatever they can get, they are ruthless and brutal. If they are committed to the spread of evil and chaos, they are even worse. Thankfully, their plans are haphazard, and any groups they join or form are poorly organized. Typically, chaotic evil people can be made to work together only by force, and their leader lasts only as long as they can thwart attempts to topple or assassinate them. Chaotic evil is sometimes called demonic because demons are the epitome of chaotic evil. Chaotic evil is the best alignment you can be because combines self-interest and pure freedom. However, chaotic evil can be a dangerous alignment because it represents the destruction not only of beauty and life but also of the order on which beauty and life "
    }
  },
  "race": {
    "human": {
      "name": "Human",
      "details": "Humans are the most adaptable of the common races. Short generations and a penchant for migration and conquest have made them physically diverse as well. Humans are often unorthodox in their dress, sporting unusual hairstyles, fanciful clothes, tattoos, and the like."
    },
    "halfling": {
      "name": "Halfling",
      "details": "Halflings are clever, capable and resourceful survivors. They are notoriously curious and show a daring that many larger people can't match. They can be lured by wealth but tend to spend rather than hoard. They prefer practical clothing and would rather wear a comfortable shirt than jewelry. Halflings stand about 3 feet tall and commonly live to see 150."
    },
    "elf": {
      "name": "Elf",
      "details": "Elves are known for their poetry, song, and magical arts, but when danger threatens they show great skill with weapons and strategy. Elves can live to be over 700 years old and, by human standards, are slow to make friends and enemies, and even slower to forget them. Elves are slim and stand 4.5 to 5.5 feet tall. They have no facial or body hair, prefer comfortable clothes, and possess unearthly grace. Many others races find them hauntingly beautiful."
    },
    "halfelf": {
      "name": "Half-Elf",
      "details": "Half-elves have the curiosity and ambition for their human parent and the refined senses and love of nature of their elven parent, although they are outsiders among both cultures. To humans, half-elves are paler, fairer and smoother-skinned than their human parents, but their actual skin tones and other details vary just as human features do.  Half-elves tend to have green, elven eyes. They live to about 180."
    },
    "gnome": {
      "name": "Gnome",
      "details": "Gnomes are in wide demand as alchemists, inventors, and technicians, though most prefer to remain among their own kind in simple comfort. Gnomes adore animals, gems, and jokes, especially pranks. They love to learn by personal experience, and are always trying new ways to build things. Gnomes stand 3 to 3.5 feet tall and live about 350 to 500 years."
    },
    "halforc": {
      "name": "Half-Orc",
      "details": "Half-Orcs are the short-tempered and sullen result of human and orc pairings. They would rather act than ponder and would rather fight than argue. They love simple pleasures, such as feasting, boasting, and wild dancing. They are an asset at the right sort of party, but not at the duchess's grand ball. Half-orcs are as tall as humans but their brutish features betray their lineage.  They regard scars as tokens of pride and things of beauty. They rarely reach 75 years of age."
    },
    "dwarf": {
      "name": "Dwarf",
      "details": "Dwarves are known for their skill in warfare, their ability to withstand physical and magical punishment, their hard work, and their capacity for drinking ale. Dwarves are slow to jest and suspicious of strangers, but they are generous to those who earn their trust. They stand just 4 to 4.5 feet tall, but are broad and compactly built, almost as wide as they are tall. Dwarven men value their beards highly."
    }
  },
  "class": {
    "fighter": {
      "name": "Fighter",
      "details": "Fighters can be many things, from soldiers to criminal enforcers. Some see adventure as a way to get rich, while others use their skills to protect the innocent. Fighters have the best all-around fighting capabilities of the PC classes, and they are trained to use all standard weapons and armor. A fighter's rigorous martial training grants them many bonus feats as they progress, and high-level fighters have access to special melee maneuvers and exotic weapons not available to any other character."
    },
    "ranger": {
      "name": "Ranger",
      "details": "Rangers are skilled stalkers and hunters who make their home in the woods. Their martial skill is nearly the equal of the fighter, but they lack the latter's dedication to the craft of fighting. Instead, the ranger focuses their skills and training on a specific enemy; a type of creature they bear a vengeful grudge against and hunt above all others. Rangers often accept the role of protector, aiding those who live in or travel through the woods. Their skills allow them to move quietly and stick to the shadows, especially in natural settings, and they also have special knowledge of certain types of creatures. Finally, an experienced ranger has such a tie to nature that they can actually draw on natural power to cast divine spells, much as a druid does, and like a druid they are often accompanied by animal companions. A ranger's Wisdom score should be high, as this determines the maximum spell level that they can cast."
    },
    "paladin": {
      "name": "Paladin",
      "details": "Paladins take their adventures seriously, and even a mundane mission is, in the heart of the paladin, a personal test an opportunity to demonstrate bravery, to learn tactics, and to find ways to do good. Divine power protects these warriors of virtue, warding off harm, protecting from disease, healing, and guarding against fear. The paladin can also direct this power to help others, healing wounds or curing diseases, and also use it to destroy evil. Experienced paladins can smite evil foes and turn away undead. A paladin's Wisdom score should be high, as this determines the maximum spell level that they can cast. Many of the paladin's special abilities also benefit from a high Charisma score."
    },
    "cleric": {
      "name": "Cleric",
      "details": "Clerics act as intermediaries between the earthly and the divine (or infernal) worlds. A good cleric helps those in need, while an evil cleric seeks to spread their patron's vision of evil across the world. All clerics can heal wounds and bring people back from the brink of death, and powerful clerics can even raise the dead. Likewise, all clerics have authority over undead creatures, and they can turn away or even destroy these creatures. Clerics are trained in the use of simple weapons, and can use all forms of armor and shields without penalty, since armor does not interfere with the casting of divine spells. In addition to their normal complement of spells, every cleric chooses to focus on two of their deity's domains. These domains grant the cleric special powers, and give them access to spells that they might otherwise never learn. A cleric's Wisdom score should be high, since this determines the maximum spell level that they can cast."
    },
    "druid": {
      "name": "Druid",
      "details": "Druids gain power not by ruling nature but by being at one with it. They hate the unnatural, including aberrations or undead, and destroy them where possible. Druids receive divine spells from nature, not the gods, and can gain an array of powers as they gain experience, including the ability to take the shapes of animals. The weapons and armor of a druid are restricted by their traditional oaths, not simply training. A druid's Wisdom score should be high, as this determines the maximum spell level that they can cast."
    },
    "monk": {
      "name": "Monk",
      "details": "Monks are versatile warriors skilled at fighting without weapons or armor. Good-aligned monks serve as protectors of the people, while evil monks make ideal spies and assassins. Though they don't cast spells, monks channel a subtle energy, called ki. This energy allows them to perform amazing feats, such as healing themselves, catching arrows in flight, and dodging blows with lightning speed. Their mundane and ki-based abilities grow with experience, granting them more power over themselves and their environment. Monks suffer unique penalties to their abilities if they wear armor, as doing so violates their rigid oath. A monk wearing armor loses their Wisdom and level based armor class bonuses, their movement speed, and their additional unarmed attacks per round."
    },
    "wizard": {
      "name": "Wizard",
      "details": "Wizards are arcane spellcasters who depend on intensive study to create their magic. To wizards, magic is not a talent but a difficult, rewarding art. When they are prepared for battle, wizards can use their spells to devastating effect. When caught by surprise, they are vulnerable. The wizard's strength is her spells, everything else is secondary. She learns new spells as she experiments and grows in experience, and she can also learn them from other wizards. In addition, over time a wizard learns to manipulate her spells so they go farther, work better, or are improved in some other way. A wizard can call a familiar- a small, magical, animal companion that serves her. With a high Intelligence, wizards are capable of casting very high levels of spells."
    },
    "barbarian": {
      "name": "Barbarian",
      "details": "Barbarians are brave, even reckless, and their warrior skills make them well suited to adventure. Instead of training and discipline, barbarians have a powerful rage that makes them stronger, tougher, and better able to withstand attacks. They only have the energy for a few such displays per day, but it is usually sufficient. Constant exposure to danger has also given barbarians a sort of 'sixth sense,' the preternatural ability to sense danger and dodge attacks, and their running stamina is legendary."
    },
    "rogue": {
      "name": "Rogue",
      "details": "Rogues have little in common with each other. While some - maybe even the majority - are stealthy thieves, many serve as scouts, spies, investigators, diplomats, and simple thugs. Rogues are versatile, adaptable, and skilled at getting what others don't want them to get. While not equal to a fighter in combat, a rogue knows how to hit where it hurts, and a sneak attack can dish out a lot of damage. Rogues also seem to have a sixth sense when it comes to avoiding danger. Experienced rogues develop nearly magical powers and skills as they master the arts of stealth, evasion, and sneak attacks. In addition, while not capable of casting spells on their own, a rogue can sometimes 'fake it' well enough to cast spells from scrolls, activate wands, and use just about any other magic item."
    },
    "sorcerer": {
      "name": "Sorcerer",
      "details": "Sorcerers are arcane spellcasters who manipulate magic energy with imagination and talent rather than studious discipline. They have no books, no mentors, no theories just raw power that they direct at will. Sorcerers know fewer spells than wizards do and acquire them more slowly, but they can cast individual spells more often and have no need to prepare their incantations ahead of time. Also unlike wizards, sorcerers cannot specialize in a school of magic. Since sorcerers gain their powers without undergoing the years of rigorous study that wizards go through, they have more time to learn fighting skills and are proficient with simple weapons. Charisma is very important for sorcerers; the higher their value in this ability, the higher the spell level they can cast."
    },
    "warlock": {
      "name": "Warlock",
      "details": "Warlocks are driven by an insatiable need for knowledge and power, which compels them to enter into a pact with an otherworldly being.  Sometimes the relationship between a warlock and their patron is like that of a cleric and a deity, though the beings that serve as patrons to warlocks are not gods.  A warlock might lead a cult dedicated to a fey prince, an archdevil, or an utterly alien entity - beings not typically served by clerics.  More often, though, the arrangement is similar to that between a master and an apprentice.  The warlock learns and grows in power, at the cost of occasional services performed on the patron's behalf."
    },
    "bard": {
      "name": "Bard",
      "details": "Bards often serve as negotiators, messengers, scouts, and spies. They love to accompany heroes (and villains) to witness heroic (or villainous) deeds firsthand, since a bard who can tell a story from personal experience earns renown among their fellows. A bard casts arcane spells without any advance preparation, much like a sorcerer. Bards also share some specialized skills with rogues, and their knowledge of item lore is nearly unmatched. A high Charisma score allows a bard to cast high-level spells."
    }
  }
}